; domain
(define
	(domain world-of-blocks)
	(:requirements :adl)
	(:predicates
		(on-top ?x ?y)
		(on-floor ?x)
		(clear ?x)
		(holding ?x)
	)
	; przesuñ paczkê na pod³ogê
	(:action podnies-z-paczki
		:parameters (?x ?z)
		:precondition
		(and
			(clear ?x)
			(on-top ?x ?z)
			(not (exists (?p) (holding ?p)))
		)
		:effect
		(and
			(not (on-top ?x ?z))
			(clear ?z)
			(holding ?x)
		)
	)
	; opusc na paczke
	(:action opusc-na-paczke
		:parameters (?y ?x)
		:precondition
		(and
			(holding ?x)
			(clear ?y)
			(not (= ?x ?y))
		)
		:effect
		(and
			(on-top ?x ?y)
			(not (clear ?y))
			(not (holding ?x))
		)
	)
	; opuszczenie na podloge
	(:action opusc-na-podloge
	    :parameters (?x)
	    :precondition
	    (and
	        (holding ?x)
	    )
	    :effect
	    (and
	        (on-floor ?x)
	        (not (holding ?x))
	    )
	)
	; podnoszenie z podlogi
	(:action podnies-z-podlogi
	    :parameters (?x)
	    :precondition
	    (and
	        (not (exists (?p) (holding ?p)))
	        (on-floor ?x)
	        (clear ?x)
	    )
	    :effect
	    (and
	        (holding ?x)
	        (not (on-floor ?x))
	    )
 
	)
)

; problem
(define (problem p1)
	(:domain world-of-blocks)
	(:objects a b c d e)
	(:init
		(clear c)
		(on-top c b)
		(on-top b a)
		(on-floor a)
		(clear e)
		(on-top e d)
		(on-floor d)
	)
	(:goal
		(and
			(exists (?p) (on-top b ?p))
			(on-top d b)
		)
	)
)

; plan
1. (podnies-z-paczki c b)
   deleted: (on-top c b)
   added: (clear b) (holding c)
   goals met: 1 of 2
2. (opusc-na-podloge c)
   deleted: (holding c)
   added: (on-floor c)
   goals met: 1 of 2
3. (podnies-z-paczki e d)
   deleted: (on-top e d)
   added: (clear d) (holding e)
   goals met: 1 of 2
4. (opusc-na-paczke c e)
   deleted: (clear c) (holding e)
   added: (on-top e c)
   goals met: 1 of 2
5. (podnies-z-podlogi d)
   deleted: (on-floor d)
   added: (holding d)
   goals met: 1 of 2
6. (opusc-na-paczke b d)
   deleted: (clear b) (holding d)
   added: (on-top d b)
   goals met: 2 of 2
